
## :x: Apply Failed (dev)

[CI link](https://github.com/a-company-jp/lgtm-tf/actions/runs/8671160583)



It failed to parse the result.

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
google_project_service.vision_api: Refreshing state... [id=lgtmgen-project/vision.googleapis.com]
google_project_service.firestore_api: Refreshing state... [id=lgtmgen-project/firestore.googleapis.com]
google_storage_bucket.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket]
google_storage_bucket_access_control.public_image_bucket: Refreshing state... [id=lgtm-public-image-bucket/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.main-repo will be created
  + resource "google_artifact_registry_repository" "main-repo" {
      + create_time      = (known after apply)
      + description      = "main repo for dev"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "asia-northeast1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "lgtmgen-project"
      + repository_id    = "dev-main"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)
    }

  # google_firestore_database.datastore_mode_database will be created
  + resource "google_firestore_database" "datastore_mode_database" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = (known after apply)
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "asia-northeast1"
      + name                              = "(default)"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "lgtmgen-project"
      + type                              = "DATASTORE_MODE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

  # google_storage_bucket.public_image_bucket will be updated in-place
  ~ resource "google_storage_bucket" "public_image_bucket" {
        id                          = "lgtm-public-image-bucket"
        name                        = "lgtm-public-image-bucket"
        # (14 unchanged attributes hidden)

      ~ cors {
          ~ origin          = [
              + null,
            ]
            # (3 unchanged attributes hidden)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.
google_firestore_database.datastore_mode_database: Creating...
google_artifact_registry_repository.main-repo: Creating...
google_storage_bucket.public_image_bucket: Modifying... [id=lgtm-public-image-bucket]
google_storage_bucket.public_image_bucket: Modifications complete after 1s [id=lgtm-public-image-bucket]
google_artifact_registry_repository.main-repo: Still creating... [10s elapsed]
google_artifact_registry_repository.main-repo: Creation complete after 12s [id=projects/lgtmgen-project/locations/asia-northeast1/repositories/dev-main]
╷
│ Error: Error creating Database: googleapi: Error 403: The caller does not have permission
│ 
│   with google_firestore_database.datastore_mode_database,
│   on firestore.tf line 5, in resource "google_firestore_database" "datastore_mode_database":
│    5: resource "google_firestore_database" "datastore_mode_database" {
│ 
╵
Releasing state lock. This may take a few moments...

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"run-terraform-apply","PRNumber":6,"Program":"tfcmt","SHA1":"f9af06a9e9442819023d093f5e276d3448ff6800","Target":"dev","Vars":{},"WorkflowName":"Run Terragrunt Apply on main branch push"} -->